workspace/blog/app/views/searches/show.html.erb

SELECT "articles".* FROM "articles" WHERE (   keywords like  '%scru%')
SELECT COUNT(*) FROM "articles" WHERE (   keywords like  '%scru%')
---

 <% if @search.search_articles.empty? %>