workspace/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title LIKE '%key%' OR keywords LIKE '%key%' or author like '%key%') ORDER BY created_at DESC
---
    def index

    #@articles = Article.all
    if params[:search]
    @articles = Article.search(params[:search]).order("created_at DESC")

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "keywords" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["keywords", "scrum"], ["updated_at", 2016-10-10 06:42:06 UTC], ["id", 1]]
---
    def update
         @article = Article.find(params[:id])

        if @article.update(article_params)