workspace/blog/app/controllers/searches_controller.rb

    def new
    @search = Search.new
    @research_method1 = Article.uniq.pluck(:research_method)
    @research_part = Article.uniq.pluck(:research_part)
    @se_method = Article.uniq.pluck(:se_method)
    @methodology = Article.uniq.pluck(:methodology)
    @ratings = Article.uniq.pluck(:rating)
---
SELECT DISTINCT "articles"."research_method" FROM "articles"
SELECT DISTINCT "articles"."research_part" FROM "articles"
SELECT DISTINCT "articles"."se_method" FROM "articles"
SELECT DISTINCT "articles"."methodology" FROM "articles"
SELECT DISTINCT "articles"."rating" FROM "articles"

    def create
    @search = Search.create(search_params)
---
INSERT INTO "searches" ("keywords1", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["keywords1", "-1#keywords#scru$"], ["created_at", 2016-10-10 06:42:46 UTC], ["updated_at", 2016-10-10 06:42:46 UTC]]

    def show
    @search = Search.find(params[:id])
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]