workspace/blog/app/controllers/welcome_controller.rb

  def index
    @list = Article.all
---
SELECT "articles".* FROM "articles"